Revit 2027 API
SpacingRule.Offset Property
An additional offset applied to the first gridline.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Offset { get; set; }
Public Property Offset As Double
	Get
	Set
public:
property double Offset {
	double get ();
	void set (double value);
}
member Offset : float with get, set
Property Value
Double
Remarks
Measured in feet. Must be between -30000' and 30000'.
See Also
Reference
SpacingRule Class
Autodesk.Revit.DB Namespace